In [1]:
import numpy as np
import pandas as pd

In [4]:
# help(pd.Series)

In [15]:
color_group = {'asia': [2,4,6], 'europe': [3,6,9], 'america': [1,2,3]}
my_data = pd.Series(color_group)
my_data

asia       [2, 4, 6]
europe     [3, 6, 9]
america    [1, 2, 3]
dtype: object

In [18]:
my_data_df = pd.DataFrame(my_data)

In [19]:
my_data_df

                 0
asia     [2, 4, 6]
europe   [3, 6, 9]
america  [1, 2, 3]

In [27]:
np.random.seed(101)
my_data = np.random.randint(0,101, (4, 3))
my_data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [38]:
salary = ['Jan', 'Feb', 'Mar']
indexRow = ['USA', 'NZ', 'CAN', 'UK']

In [39]:
salary_df = pd.DataFrame(data=my_data,index=indexRow, columns=salary)
salary_df

     Jan  Feb  Mar
USA   95   11   81
NZ    70   63   87
CAN   75    9   77
UK    40    4   63